Repository: KadyrKZ/MindShieldApp
Catalog: DiagnosticDimentionApp/Resources/Constants/Localizable.xcstrings
Source language: en
Languages: ru

source: Access to the gallery is not available.
ru: Доступ к галерее недоступен.

source: Camera Unavailable
ru: Камера недоступна

source: Chose system language
ru: Выбрать язык

source: Clear
ru: Очистить

source: Diagnosis saved!
ru: Результаты сохранены

source: Diagnosis show as:
ru: Диагностика показывает:

source: Diagnosis Summary
ru: Итог диагностики

source: Diagnosis:
ru: Диагноз:

source: Diagnostics
ru: Диагностика

source: Disclaimer: This app does not replace a doctor's consultation. The results are preliminary and for informational purposes only.
ru: Отказ от ответственности: Это приложение не заменяет консультацию врача. Результаты являются предварительными и приводятся исключительно в информационных целях.

source: Done
ru: Сохранить

source: Enter name to save result
ru: Введите имя, чтобы сохранить результат

# finger_flipping_description_key
source: This Parkinson’s exercise, isolated finger flicks, helps improve finger dexterity and coordination. Flick each finger individually—starting with the index, followed by the middle, ring, and little finger. Perform with both hands simultaneously or one at a time to enhance fine motor control.
ru: Это упражнение для пациентов с болезнью Паркинсона, состоящее из отдельных движений пальцами, помогает улучшить их ловкость и координацию. Двигайте каждым пальцем по отдельности — начиная с указательного, затем средним, безымянным и мизинцем. Выполняйте обеими руками одновременно или по очереди для улучшения контроля мелкой моторики.

# finger_flipping_title_key
source: Finger Flipping
ru: Щелчок пальцами

# for_body_key
source: For Body
ru: Для тело

# for_brain_key
source: For Brain
ru: Для мозга

# for_fine_motor_skills_key
source: For Fine Motor Skills
ru: Для мелкой моторики

source: Gait
ru: Походка

source: Gallery Unavailable
ru: Галерия недоступна

source: Hand
ru: Рука

source: High
ru: Высокий

source: History
ru: История

# instructions_text_key
source: Instructions: 1. Tap "Record Video" to record. 2. Follow recommendations (lighting, angle). 3. Wait for diagnosis results.
ru: Инструкции: 1. Нажмите "Записать видео" для записи. 2. Следуйте рекомендациям (освещение, угол обзора). 3. Дождитесь результатов диагностики.

# loadingMessageKey
source: Please wait. Diagnostics takes 1 to 5 minutes.
ru: Пожалуйста, подождите. Диагностика занимает от 1 до 5 минут.

source: Low
ru: Низкий

# MeetingText
source: This app is designed for diagnosing cognitive impairments, such as Alzheimer's and Parkinson's disease. You can record a video of your gait and get a preliminary result expressed in percentage.
ru: Это приложение предназначено для диагностики когнитивных нарушений, таких как болезни Альцгеймера и Паркинсона. Вы можете записать на видео свою походку и получить предварительный результат выраженный в процентах.

source: Middle
ru: Средний

# mind_train_description_key
source: Let's start the exercise with you, your task is to recite any poem you know by heart and solve the examples in parallel.In the first column there are simpler examples, in the second column there are more complex ones, but the difficulty is that you have to tell a poem without stopping and give an answer to these examples, if suddenly you stop, then we start all over again. First, we tell the poem and decide from the first example, Let's try. In this way, you use not only mental functions, but also attention.
ru: Давайте начнем упражнение с вас, ваша задача - продекламировать любое стихотворение, которое вы знаете наизусть, и параллельно решать примеры.В первой колонке есть более простые примеры, во второй колонке - более сложные, но сложность в том, что вы должны рассказывать стихотворение без остановки и давать ответ на эти примеры, если вдруг вы останавливаетесь, то мы начинаем все сначала. Сначала мы рассказываем стихотворение и решаем, исходя из первого примера, давайте попробуем. Таким образом, вы задействуете не только мыслительные функции, но и внимание.

source: OK
ru: ОК

# open_hand_spreads_description_key
source: The open hand spreads exercise helps reactivate hand muscles and improve dexterity for Parkinson’s. Spread fingers wide, then bring them back together. Perform with palms up, elbows straight, and wrists extended. This can be done in various positions for flexibility.
ru: Упражнение "Разведение рук в стороны" помогает активизировать мышцы рук и улучшить ловкость при Болезни Паркинсона. Широко разведите пальцы, затем сведите их вместе. Выполняйте его ладонями вверх, локти выпрямлены, запястья вытянуты. Это можно делать в различных положениях для повышения гибкости.

# open_hand_spreads_title_key
source: Open Hand spreads
ru: Раскрытая ладонь расправляется

# prayer_stretch_description_key
source: This exercise for Parkinson’s involves lacing fingers together, inverting the hands, and lifting the elbows to stretch the shoulders dynamically. It can also be done statically by stretching one arm at a time, holding for 10–30 seconds to improve flexibility.
ru: Это упражнение для лечения болезни Паркинсона включает в себя переплетение пальцев, переворачивание кистей и поднятие локтей, чтобы динамически растянуть плечи. Его также можно выполнять статически вытягивая одну руку за раз, удерживая ее в таком положении в течение 10-30 секунд для улучшения гибкости.

# prayer_stretch_title_key
source: Prayer Stretch
ru: Молитвенная растяжка

source: Probability of Parkinson's:
ru: Вероятность развития:

source: Probability:
ru: Вероятность:

source: Record Video
ru: Запись видео

source: Save
ru: Сохранить

source: Select Video from Gallery
ru: Выберите видео из галереи

source: Settings
ru: Настройки

source: Start
ru: Начать

source: Starting video upload:
ru: Запуск загрузки видео:

source: Success
ru: Успешно сохранено

source: System theme
ru: Тема системы

source: The result may be inaccurate.
ru: Результаты могут быть некорректными

source: The result may be inaccurate. For a more precise diagnosis, please consult a specialized center.
ru: Результат может быть неточным. Для постановки более точного диагноза, пожалуйста, обратитесь в специализированный центр.

source: This device does not support video recording.
ru: Данное устройство не поддерживает запись видео.

# training_mind_title_key
source: Recite & Solve
ru: Рассказывай и Решай

# training_title_key
source: Training
ru: Тренировка

# training_walking_body_description_key
source: This Parkinson’s exercise, known as tandem walking, improves balance and coordination. Focus on a fixed point ahead, placing your heel directly in front of the opposite foot’s toe with each step. Repeat for 20 steps to enhance stability and mobility.
ru: Это упражнение при болезни Паркинсона, известное как ходьба в тандеме, улучшает равновесие и координацию движений. Сосредоточьтесь на неподвижной точке впереди, поставив пятку прямо перед противоположной двигайте носком ноги при каждом шаге. Повторите упражнение в течение 20 шагов, чтобы повысить устойчивость и мобильность.

# training_walking_body_title_key
source: Training Walking
ru: Тренировочная ходьба

source: Unknown
ru: Без имени

source: Upload Error
ru: Ошибка при загрузке. Проверьте соединение

source: Very High
ru: Очень высокий

source: Very Low
ru: Очень низкий

source: Video recording is not available on this device.
ru: Запись видео на этом устройстве недоступна.

source: Video Recording Unavailable
ru: Запись видео недоступна

source: Video upload error:
ru: Ошибка при загрузке видео:

source: Video upload successful. Server response:
ru: Загрузка видео прошла успешно. Ответ сервера:

source: Watch Instruction Video
ru: Смотрите видео-инструкцию

source: Welcome to Cognitive Diagnostics
ru: Добро пожаловать в когнитивную диагностику
